zoo = {
  'пингвины, попугаи': {'top':'','right':'казуары, рогатые вороны','bot':'журавли','left':''},
  'жабы, лягушки': {'top':'','right':'','bot':'оранжерея','left':'слоны'},
  'пеликаны': {'top':'бабочки, птицы','right':'туры, горные козлы','bot':'лебеди','left':''},
  'фламинго': {'top':'грифы, орланы','right':'утки','bot':'','left':'пауки'},
  'змеи, ящерицы': {'top':'сурок','right':'','bot':'волки','left':'серый тюлень'},  
  'леопард,рыси': {'top':'гривистый волк','right':'тапир','bot':'ягуарунди','left':''},
  'жираф': {'top':'тапир','right':'грифы','bot':'пауки','left':'малая панда'},
  'большая панда': {'top':'манул','right':'фазаны','bot':'','left':''},  
  'бурый медведь': {'top':'шакалы','right':'азиатские львы','bot':'жираф','left':'бабочки'},
  'обезьяны': {'top':'сурикаты','right':'крокодилы','bot':'детский зоопарк','left':'росомаха'},
  'манул': {'top':'малая панда','right':'жираф','bot':'большая панда','left':'медведь-губач'}
}

def neighbour(zoo, animal, side):
    return print(zoo[animal][side])



if __name__ == "__main__":   
  neighbour(zoo, 'манул', 'top')
  neighbour(zoo, 'манул', 'right')
  neighbour(zoo, 'манул', 'bot')
  neighbour(zoo, 'манул', 'left')

